In [1]:
import wrangle

Importing data from csv file and reading to df using `wrangle.py` function

In [2]:
df = wrangle.get_curriculum_logs_data()
df.head()

The df has 847330 rows and 10 columns.

,cohortid,start_date,end_date,cohortname,program_id,date,time,path,user_id,ip,program_name,is_staff
0,1,2014-02-04,2014-04-22,Arches,1,2018-01-26,10:14:47,/,11,97.105.19.61,web_dev,False
1,1,2014-02-04,2014-04-22,Arches,1,2018-01-26,10:14:51,javascript-i,11,97.105.19.61,web_dev,False
2,1,2014-02-04,2014-04-22,Arches,1,2018-01-26,10:15:02,javascript-i/functions,11,97.105.19.61,web_dev,False
3,1,2014-02-04,2014-04-22,Arches,1,2018-01-26,11:46:29,appendix/further-reading/javascript/hoisting.html,11,97.105.19.61,web_dev,False
4,1,2014-02-04,2014-04-22,Arches,1,2018-01-26,11:46:39,appendix,11,97.105.19.61,web_dev,False

Getting familiar with the data...

In [10]:
for col in df.columns:
    if df[col].nunique() < 8:
        print(f'Unique values for {col}:')
        print(df[col].value_counts())
#         print(f'{col} has {df[col].nunique()} unique values.')
        print()
    else:
        print(f'{col} has more than 8 unique values.')
        print()

cohortid has more than 8 unique values.

start_date has more than 8 unique values.

end_date has more than 8 unique values.

cohortname has more than 8 unique values.

Unique values for program_id:
2    713365
3    103412
1     30548
4         5
Name: program_id, dtype: int64

date has more than 8 unique values.

time has more than 8 unique values.

path has more than 8 unique values.

user_id has more than 8 unique values.

ip has more than 8 unique values.

Unique values for program_name:
web_dev         743918
data_science    103412
Name: program_name, dtype: int64

Unique values for is_staff:
False    763299
True      84031
Name: is_staff, dtype: int64

In [3]:
print(f'There is {df.isna().sum().sum()} null value(s).')
print()
print(df.info())

There is 1 null value(s).

<class 'pandas.core.frame.DataFrame'>
Int64Index: 847330 entries, 0 to 847329
Data columns (total 12 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   cohortid      847330 non-null  int64
 1   start_date    847330 non-null  datetime64[ns]
 2   end_date      847330 non-null  datetime64[ns]
 3   cohortname    847330 non-null  object
 4   program_id    847330 non-null  int64
 5   date          847330 non-null  datetime64[ns]
 6   time          847330 non-null  object
 7   path          847329 non-null  object
 8   user_id       847330 non-null  int64
 9   ip            847330 non-null  object
 10  program_name  847330 non-null  object
 11  is_staff      847330 non-null  bool
dtypes: bool(1), datetime64[ns](3), int64(3), object(5)
memory usage: 78.4+ MB
None

Investigating the x1 null value . . .

In [11]:
# investigating the x1 null value
df[df.path.isna()]

,cohortid,start_date,end_date,cohortname,program_id,date,time,path,user_id,ip,program_name,is_staff
562633,55,2020-02-03,2020-07-07,Curie,3,2020-04-08,09:25:18,NaN,586,72.177.240.51,data_science,False

What I know about the x1 null:
- For this log entry, the curriculum was accessed between cohort start and end dates, in the morning
- This was a user from the `Curie` cohort
- The null log was from user `586`

In [5]:
# df[(df.cohortname == 'Curie') & (df.date == '2020-04-08') & (df.time <= '09:30:00') & (df.user_id == 586)]\
#                                             .sort_values(by = 'time')

Since the null value is only a tiny fraction of the total data will drop for now. In second look can also check what other cohort-mates were looking at around this time +/- 5 or 10m and take the mode and fill the na.

In [12]:
df.dropna(inplace = True)
df.shape

(847329, 12)